<template>
  <div class="about">
    <h1>Об игре</h1>

    <div class="content">
      <p>
        Любимая многими серия "Кодовые имена" пополнилась еще одной отличной
        игрой, которая не оставит равнодушной ни одну веселую компанию. В этот
        раз никакой вражды между игроками! Объединяйтесь, чтобы выполнить
        задание, но поторапливайтесь, время ограничено!
      </p>

      <p>
        Вражеские агенты уже в наших рядах. Придется усилить меры безопасности.
        Игрокам необходимо узнать секретный шифр в интереснейшей настольной игре
        "Кодовые имена. Дуэт". Новой игрой популярной серии "Кодовые имена"
        теперь можно наслаждаться в самом тесном кругу.
      </p>

      <iframe
        src="https://hobbygames.ru/download/rules/0016CodenamesDuet.pdf"
      />
    </div>
  </div>
</template>

<style scoped>
iframe {
  border: none;
  width: 100%;
  height: 80vh;
}
</style>
